30-07-2018/bin/src/test/java/com/SpringRestMongoDB/WS/SoapTest.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body>
        <ns2:addition_monnaie xmlns:ns2="http://WebService/">
            <montant1>5.0</montant1>
            <montant2>3.0</montant2>
        </ns2:addition_monnaie>
    </S:Body>
</S:Envelope>